package lesson_3.homework_03;

/*
Task 3 * (Опционально)
Пусть цена товара A составляет 1000 Euro, а товара B составляет 500 Euro.

Если клиент покупает товары вместе, то на них действует скидка 10% на всю покупку.

Выведите на экран значение переменной, которая соответствует стоимости товаров A+B со скидкой.
Отдельно выведите на экран сумму скидки для этой покупки (в деньгах).
 */
public class Task_3 {
    public static void main(String[] args) {
        double priceA = 1000;
        double priceB = 500;

        double discountMoney;

    }
}
