package homework_19;
/*
Task 2
Неизменяемая переменная
•	Объявите переменную final int MAX_USERS = 100;.
•	Попробуйте изменить значение MAX_USERS в коде после её инициализации.
•	Объясните, что произошло при попытке изменения значения.
 */

public class Task_2 {

    public final int MAX_USERS = 100;

    //int MAX_USERS = 150;

    //невозможно изменить константу
    //1.final и имя переменной из больших букв говорят что мы имеем дело с константой.
    // Переменная, которая имеет постоянное значение для всех и ее никто не может изменить.

}
